[
  {
    "Measurement": "Incoming traffic",
    "Description": "Indicates the rate at which data (including framing characters) is received on a network interface.",
    "MeasurementUnit": "Mbps",
    "Interpretation": "An abnormally high rate of incoming traffic may require additional analysis. For a managed Hyper-V or Hyper-V VDI component, the Windows Network Traffic test reports metrics for an additional Total descriptor. For this descriptor, this measure will reveal the rate of incoming data traffic on all network interfaces supported by the Hyper-V or Hyper-V VDI host."
  },
  {
    "Measurement": "Outgoing traffic",
    "Description": "Represents the rate at which data (including framing characters) is sent on a network interface.",
    "MeasurementUnit": "Mbps",
    "Interpretation": "An abnormally high rate of outgoing traffic may require additional analysis. For a managed Hyper-V or Hyper-V VDI component, the Windows Network Traffic test reports metrics for an additional Total descriptor. For this descriptor, this measure will reveal the rate of outgoing data traffic on all network interfaces supported by the Hyper-V or Hyper-V VDI host."
  },
  {
    "Measurement": "Max bandwidth",
    "Description": "An estimate of the capacity of a network interface.",
    "MeasurementUnit": "Mbps",
    "Interpretation": "This measure will not be reported for the 'Total' descriptor of this test."
  },
  {
    "Measurement": "Bandwidth usage",
    "Description": "Indicates the total rate of data handled by a network interface.",
    "MeasurementUnit": "Percent",
    "Interpretation": "By comparing the bandwidth usage with the maximum bandwidth of an interface, an administrator can determine times when the network interface is overloaded or is being a performance bottleneck. For a managed Hyper-V or Hyper-V VDI component, the Windows Network Traffic test reports metrics for an additional Total descriptor. For this descriptor, this measure will reveal the total bandwidth used by the target Hyper-V or Hyper-V VDI host across all its network interfaces."
  },
  {
    "Measurement": "Output queue length",
    "Description": "Indicates the length of the output packet queue (in packets).",
    "MeasurementUnit": "Number",
    "Interpretation": "If this is longer than 2, delays are being experienced and the bottleneck should be found and eliminated if possible. For a managed Hyper-V or Hyper-V VDI component, the Windows Network Traffic test reports metrics for an additional Total descriptor. For this descriptor, this measure will reveal the total number of packets in the output queues of all network interfaces supported by the Hyper-V or Hyper-V VDI host."
  },
  {
    "Measurement": "Outbound packet errors",
    "Description": "Indicates the number of outbound packets that could not be transmitted because of errors.",
    "MeasurementUnit": "Number",
    "Interpretation": "Ideally, number of outbound errors should be 0. For a managed Hyper-V or Hyper-V VDI component, the Windows Network Traffic test reports metrics for an additional Total descriptor. For this descriptor, this measure will reveal the total number of outbound packets with errors on all network interfaces supported by the Hyper-V or Hyper-V VDI host."
  },
  {
    "Measurement": "Inbound packet errors",
    "Description": "Indicates the number of inbound packets that contained errors preventing them from being deliverable to a higher-layer protocol.",
    "MeasurementUnit": "Number",
    "Interpretation": "Ideally, number of inbound errors should be 0. For a managed Hyper-V or Hyper-V VDI component, the Windows Network Traffic test reports metrics for an additional Total descriptor. For this descriptor, this measure will reveal the total number of inbound packets with errors on all network interfaces supported by the Hyper-V or Hyper-V VDI host."
  }
]
